software/gnu_stow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-19 Tue 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gnu Stow</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Gnu Stow</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org88ab829">1. How to Setup GNU Stow</a></li>
<li><a href="#org86b302d">2. Woah woah, what&rsquo;s a GNU Stow?</a>
<ul>
<li><a href="#org6ece7ab">2.1. Symlink? **</a></li>
</ul>
</li>
<li><a href="#orge8903fd">3. Let&rsquo;s Download Stow</a></li>
<li><a href="#org7c01759">4. Setting up a Dotfiles Directory</a></li>
<li><a href="#orgf6d8244">5. How to Add Config Files in Stow</a></li>
<li><a href="#org3661412">6. Adding Version Control</a></li>
<li><a href="#org9190ad1">7. Conclusion</a></li>
</ul>
</div>
</div>
<div id="outline-container-org88ab829" class="outline-2">
<h2 id="org88ab829"><span class="section-number-2">1.</span> How to Setup GNU Stow</h2>
<div class="outline-text-2" id="text-1">
<p>
If there&rsquo;s one UNIX tool that makes managing dotfiles across multiple machines effortless, it&rsquo;s <b><b>GNU Stow</b></b>.
</p>

<p>
When used correctly, it enables version control for your configuration files and makes tracking changes seamless.
Setting up your dotfiles on a new machine also becomes a simple, three-step process.
</p>

<p>
In this tutorial, I&rsquo;ll help you setup stow for your UNIX systems (Linux, Mac, BSD) so you can finally make dotfiles management easier.
</p>
</div>
</div>
<div id="outline-container-org86b302d" class="outline-2">
<h2 id="org86b302d"><span class="section-number-2">2.</span> Woah woah, what&rsquo;s a GNU Stow?</h2>
<div class="outline-text-2" id="text-2">
<p>
As said by the stow documentation:
</p>

<p>
GNU Stow is a symlink farm manager which takes distinct packages of software and/or data located in separate directories on the filesystem,
and makes them appear to be installed in the same place.
</p>

<p>
Not the best way to describe it, so here is a simple version of what stow does:
</p>

<p>
Stow is a commandline tool that automates the creation of symlinks on your machine. Therefore it can create links from one part of the system to the other.
</p>

<p>
For example:
.config/i3 could be a symbolic link that actually points to ~/dotfiles/i3/.config/i3
</p>
</div>
<div id="outline-container-org6ece7ab" class="outline-3">
<h3 id="org6ece7ab"><span class="section-number-3">2.1.</span> Symlink? **</h3>
<div class="outline-text-3" id="text-2-1">
<p>
As a quick explainer: a symlink is a file that acts as a pointer to another file.
So when you open the i3 file in .config/i3 it will open the file that is located in ~/dotfiles/i3/.config/i3
</p>
</div>
</div>
</div>
<div id="outline-container-orge8903fd" class="outline-2">
<h2 id="orge8903fd"><span class="section-number-2">3.</span> Let&rsquo;s Download Stow</h2>
<div class="outline-text-2" id="text-3">
<p>
Before you start implementing what I&rsquo;ll be showing, it&rsquo;s a good idea to make sure that <b><b>Git</b></b> is installed on your system.
</p>

<p>
You can download both git and stow through your package manager:
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #928374;"># </span><span style="color: #928374;">For mac</span>
   brew install <span style="color: #fabd2f;">git</span> stow

   <span style="color: #928374;"># </span><span style="color: #928374;">For Debian systems</span>
   <span style="color: #fabd2f;">sudo</span> apt install <span style="color: #fabd2f;">git</span> stow

   <span style="color: #928374;"># </span><span style="color: #928374;">For OpenSUSE systems</span>
   <span style="color: #fabd2f;">sudo</span> zypper install <span style="color: #fabd2f;">git</span> stow

   <span style="color: #928374;"># </span><span style="color: #928374;">For Arch systems</span>
   <span style="color: #fabd2f;">sudo</span> pacman -S <span style="color: #fabd2f;">git</span> stow
</pre>
</div>

<p>
If everything went alright, you should now have everything you need to continue. Great!
</p>
</div>
</div>
<div id="outline-container-org7c01759" class="outline-2">
<h2 id="org7c01759"><span class="section-number-2">4.</span> Setting up a Dotfiles Directory</h2>
<div class="outline-text-2" id="text-4">
<p>
In my experience, stow works best when you symlink from a directory somewhere in your home directory.
So open the commandline on your system and make sure that you are in your home directory:
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #fabd2f;">cd</span> $<span style="color: #83a598;">HOME</span>

   <span style="color: #928374;"># </span><span style="color: #928374;">Just typing </span><span style="color: #928374;">cd</span><span style="color: #928374;"> will do the same thing</span>
   <span style="color: #fabd2f;">cd</span>
</pre>
</div>

<p>
Then create a directory. You can choose what name to give, but for this tutorial, I will go with <b><b>dotfiles</b></b>:
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #fabd2f;">mkdir</span> dotfiles

   <span style="color: #928374;"># </span><span style="color: #928374;">cd</span><span style="color: #928374;"> into your new directory</span>
   <span style="color: #fabd2f;">cd</span> dotfiles
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf6d8244" class="outline-2">
<h2 id="orgf6d8244"><span class="section-number-2">5.</span> How to Add Config Files in Stow</h2>
<div class="outline-text-2" id="text-5">
<p>
Stow has a certain way of adding dotfiles that might seem a bit weird, but makes it very easy to work with.
Inside of dotfiles, you create a new folder with the name of the package, and inside of there, you will recreate the path of the actual dotfiles.
Here is a small example using zsh and neovim:
</p>

<div class="org-src-container">
<pre class="src src-nil">   dotfiles/
   ├── zsh/
   │   ├── .zshrc
   │   └── .zsh_aliases
   ├── nvim/
   │   └── .config/nvim/init.lua
</pre>
</div>

<p>
So let&rsquo;s implement it for zsh! Go into your dotfiles folder and create a new directory named &rsquo;zsh&rsquo;:
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #fabd2f;">mkdir</span> zsh
   <span style="color: #fabd2f;">cd</span> zsh
</pre>
</div>

<p>
Then we need to move our current .zshrc file into this new directory.
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #928374;"># </span><span style="color: #928374;">Move your zshrc into your current directory</span>
   <span style="color: #fabd2f;">mv</span> ~/.zshrc ~/dotfiles/zsh/
</pre>
</div>

<p>
In order to test if this has worked, open a new terminal, and check if you see a message saying that no zshrc has been found.
<b><b>Do not create a new one!</b></b> We are going to fix this problem right now.
</p>

<p>
Alright, go back into your dotfiles directory and type out the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash">   stow zsh
</pre>
</div>

<p>
No errors? Good, that means the symlinking was successful.
If you look in your file explorer, you should see a .zshrc there with a special sign depending on the file explorer that you use.
</p>

<p>
Can&rsquo;t see the file? Make sure that hidden files and folders are visible in your file explorer.
</p>

<p>
Let&rsquo;s try and open a new terminal. If everything went alright, your zsh config should be there when you first start your shell.
Not entirely sure? Add a debug message into your config to make sure. If you see that message, you know it worked.
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #fabd2f;">echo</span> <span style="color: #b8bb26;">"It works!"</span> &gt;&gt; ~/dotfiles/zsh/.zshrc
</pre>
</div>
</div>
</div>
<div id="outline-container-org3661412" class="outline-2">
<h2 id="org3661412"><span class="section-number-2">6.</span> Adding Version Control</h2>
<div class="outline-text-2" id="text-6">
<p>
This step is by far the most simple.
Go into your dotfiles folder and initialize a new Git repository.
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #fabd2f;">git</span> init .
</pre>
</div>

<p>
And that&rsquo;s it! If you want to link it up to a GitHub repository, you can use the following command.
Make sure that you create your own <b><b>PRIVATE</b></b> repository and use your own link for this:
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #fabd2f;">git</span> remote add origin https://github.com/your-username/your-repo-name.git
</pre>
</div>

<p>
In order to save your changes, just use the following commands:
</p>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #928374;"># </span><span style="color: #928374;">Stage all files in your dotfiles directory</span>
   <span style="color: #fabd2f;">git</span> add .

   <span style="color: #928374;"># </span><span style="color: #928374;">Create a commit with message</span>
   <span style="color: #fabd2f;">git</span> commit -m <span style="color: #b8bb26;">"Added: zsh config"</span>

   <span style="color: #928374;"># </span><span style="color: #928374;">And... Push!</span>
   <span style="color: #928374;"># </span><span style="color: #928374;">Change main to the name of your branch (e.g. master, head)</span>
   <span style="color: #fabd2f;">git</span> push -u origin main
</pre>
</div>
</div>
</div>
<div id="outline-container-org9190ad1" class="outline-2">
<h2 id="org9190ad1"><span class="section-number-2">7.</span> Conclusion</h2>
<div class="outline-text-2" id="text-7">
<p>
GNU Stow might take a bit of time before you really understand it, but that&rsquo;s okay!
It&rsquo;s only when you understand the basics that you can see what cool things you can do with it.
For example: I used Git branches to create different themes for my stowed dotfiles. Even if it isn&rsquo;t the cleanest way to do things, it works surprisingly well.
</p>

<p>
Thank you for following along, and enjoy your newfound vision of the art of dotfiles management!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-19-08 23:35</p>
<p class="date">Created: 2025-08-19 Tue 23:35</p>
</div>
</body>
</html>
